БухЭксп/Catalogs/CW_ВерсииБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВерсииБюджетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_УтверждениеБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_УтверждениеБюджетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыБюджетовПоЗаявкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ИсторияУтверждениеБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ИсторияУтверждениеБюджетов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыБюджетовПоЗаявкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПризнакУтверждения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВерсииБюджетов/Forms/ФормаУправленияВерсиями/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеБюджетов");
	Параметры.Свойство("ЭтоГрузоперевозка",ЭтоГрузоперевозка);
	
	Заказ 					= Параметры.Заказ;  
	Грузоперевозка 			= Параметры.Грузоперевозка;
	ВыбраннаяВерсия 		= Параметры.ВыбраннаяВерсия;
	ПустойЗаказ 			= Заказ.Пустая();
	ПустаяГрузоперевозка 	= Грузоперевозка.Пустая();
	
	Если ЭтоГрузоперевозка Тогда
		Элементы.СправочникВерсииБюджетовБюджетУтвердить.Доступность = ПустойЗаказ;
	КонецЕсли; 
	
	Если Параметры.Свойство("флРежимВыбораДляКопирования") Тогда 
		Заголовок 						= "Выбор версии, в которую копируем";
		Команды.ОК.Заголовок 			= "Выбрать";
		флРежимВыбораДляКопирования 	= Параметры.флРежимВыбораДляКопирования;
		ВерсияЗапрещененаяКВыбору 		= Параметры.ВерсияЗапрещененаяКВыбору;
		
		Элементы.СправочникВерсииБюджетовКоманднаяПанель.Видимость = Ложь;
	КонецЕсли;
	
	Если ПустойЗаказ Тогда 
		ОбъектВКоторомУтверждаетсяБюджет = Грузоперевозка;
	Иначе
		ЭтоГрузоперевозка = Ложь;
		ОбъектВКоторомУтверждаетсяБюджет = Заказ;
	КонецЕсли;
	
	СписокВерсийБюджета.Параметры.УстановитьЗначениеПараметра("ОбъектСсылка"		, ОбъектВКоторомУтверждаетсяБюджет);
	СписокВерсийБюджета.Параметры.УстановитьЗначениеПараметра("ЭтоГрузоперевозка"	, ЭтоГрузоперевозка);
	СписокВерсийБюджета.Параметры.УстановитьЗначениеПараметра("Пользователь"		, CW_Настройки.Пользователь());
	
	_СпозиционироватьсяНаВыбраннуюВерсию(ВыбраннаяВерсия);
	
	// из нового объекта - доступен только выбор версии
	// копирование/очистку/утверждение отключаем
	Элементы.СписокВерсийБюджетаКоманднаяПанель.Доступность 		= Не (ПустойЗаказ И ПустаяГрузоперевозка);
	
	Элементы.СправочникВерсииБюджетовБюджетКопировать.Доступность 	= ПравоРедактирования;
	Элементы.СправочникВерсииБюджетовБюджетОчистить.Доступность 	= ПравоРедактирования;
	
КонецПроцедуры


//&НаСервере
Процедура _СпозиционироватьсяНаВыбраннуюВерсию(ВыбраннаяВерсия)
	
	Элементы.СписокВерсийБюджета.ТекущаяСтрока =  ВыбраннаяВерсия;

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ТекущиеДанные = Элементы.СписокВерсийБюджета.ТекущиеДанные;
	
	Если флРежимВыбораДляКопирования Тогда 
		Если ТекущиеДанные.Ссылка = ВерсияЗапрещененаяКВыбору Тогда 
			ПоказатьПредупреждение(,"Это исходная версия. А надо выбрать версию, в которой будет создана копия");
			Возврат;
		КонецЕсли;
		Если ТекущиеДанные.ЭтоУтвержденнаяВерсия Тогда 
			ПоказатьПредупреждение(,"Это утвержденная версия, в ней запрещены изменения.");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Закрыть(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СправочникВерсииБюджетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// выбор? или открыть элемент
	ОК(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура БюджетУтвердить(Команда)
	
	ТекущиеДанные = Элементы.СписокВерсийБюджета.ТекущиеДанные;
	
	Если НЕ Неопределено = ТекущиеДанные Тогда 
		
		Если ТекущиеДанные.ЭтоУтвержденнаяВерсия Тогда 
			
			// проверяем права на отмену утверждение
			Если НЕ _ЕстьПравоНаОтменуУтверждения() Тогда
				ПоказатьПредупреждение(,"Недостаточно прав для отмены блокировки версии бюджета.");
				Возврат;
			КонецЕсли; 
			
			// отмена утверждения
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОтменыУтверждения",ЭтотОбъект, Новый Структура("ТекущиеДанные",ТекущиеДанные)); 
			ПоказатьВопрос(ПОВ,"Версия """+Строка(ТекущиеДанные.Ссылка)+""" уже заблокирована."+Символы.ПС+"Отменить блокировку?", РежимДиалогаВопрос.ОКОтмена); 
						
		Иначе 
			
			// проверяем права на отмену утверждение
			Если НЕ _ЕстьПравоНаУтверждение() Тогда
				ПоказатьПредупреждение(,"Недостаточно прав для утверждения.");
				Возврат;
			КонецЕсли;
			
			// установка признака Утверждения
			Если ТекущиеДанные.КоличествоСтатей=0 Тогда
				ПоказатьПредупреждение(,
					"Невозможно заблокирвоать версию бюджета."+Символы.ПС+"По текущей версия бюджета ("+Строка(ТекущиеДанные.Ссылка)+") не введено ни одной статьи.");
				Возврат;
			КонецЕсли;
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУтверждения",ЭтотОбъект, Новый Структура("ТекущиеДанные",ТекущиеДанные)); 
			ПоказатьВопрос(ПОВ,"Заблокировать версию бюджета: """+Строка(ТекущиеДанные.Ссылка)+"""?", РежимДиалогаВопрос.ОКОтмена);
			
		КонецЕсли;
		
		флИзменилсяСоставИспользуемыхВерсий = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОтменыУтверждения(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.ОК) Тогда
		
		_БюджетОтменаУтверждения(ДополнительныеПараметры.ТекущиеДанные.Ссылка);
		УстановитьИмяИкартинкуКнопкиНаСервере(Ложь);
		Элементы.СписокВерсийБюджета.Обновить();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУтверждения(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.ОК) Тогда
		
		_БюджетУстановкаУтверждения(ДополнительныеПараметры.ТекущиеДанные.Ссылка);
		УстановитьИмяИкартинкуКнопкиНаСервере(Истина);
		Элементы.СписокВерсийБюджета.Обновить();

	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ЕстьПравоНаУтверждение()
	// --- 
	
	Возврат(CW_ПраваДоступа.ПравоДоступно("УтверждениеБюджетов"));
	
	// --- 
КонецФункции

&НаСервере
Функция _ЕстьПравоНаОтменуУтверждения()
	// --- 
	
	Возврат(CW_ПраваДоступа.ПравоДоступно("ОтменаУтвержденияБюджетов"));
	
	// --- 
КонецФункции
 

&НаСервере
Процедура _БюджетОтменаУтверждения(ВерсияБюджета)

	рсмз = РегистрыСведений.CW_УтверждениеБюджетов.СоздатьМенеджерЗаписи();
	рсмз.ВерсияБюджета = ВерсияБюджета;
	рсмз.Объект = ОбъектВКоторомУтверждаетсяБюджет;
	рсмз.Удалить();

	_ЗаписатьИсториюУтвержденияБюджета(ВерсияБюджета,Ложь);
	
КонецПроцедуры

&НаСервере
Процедура _БюджетУстановкаУтверждения(ВерсияБюджета)

	рсмз = РегистрыСведений.CW_УтверждениеБюджетов.СоздатьМенеджерЗаписи();
	рсмз.ВерсияБюджета = ВерсияБюджета;
	рсмз.Объект = ОбъектВКоторомУтверждаетсяБюджет;
	рсмз.Записать();
	
	_ЗаписатьИсториюУтвержденияБюджета(ВерсияБюджета,Истина);

КонецПроцедуры

&НаСервере
Процедура _ЗаписатьИсториюУтвержденияБюджета(ВерсияБюджета,ПризнакУтверждения)
	// --- 
	
	УстановитьПривилегированныйРежим(Истина);
	// --- 
	Запись = РегистрыСведений.CW_ИсторияУтверждениеБюджетов.СоздатьМенеджерЗаписи();
	Запись.ВерсияБюджета = ВерсияБюджета;
	Запись.Объект = ОбъектВКоторомУтверждаетсяБюджет;
	Запись.Период = ТекущаяДата();
	Запись.Пользователь = CW_Настройки.Пользователь();
	Запись.ПризнакУтверждения = ПризнакУтверждения;
	Запись.Записать(Истина);
	
	// --- 
КонецПроцедуры
 

&НаКлиенте
Процедура БюджетОчистить(Команда)
	
	ТекущиеДанные = Элементы.СписокВерсийБюджета.ТекущиеДанные;
	Если (ТекущиеДанные <> Неопределено) Тогда 
		
		Если ТекущиеДанные.ЭтоУтвержденнаяВерсия Тогда 
			ПоказатьПредупреждение(,"Текущая версия бюджета ("+Строка(ТекущиеДанные.Ссылка)+") уже утверждена.
				|Очистка не будет выполнена.");
			Возврат;
		КонецЕсли;
		Если ТекущиеДанные.КоличествоСтатей=0 Тогда 
			ПоказатьПредупреждение(,
				"По текущей версия бюджета ("+Строка(ТекущиеДанные.Ссылка)+") не введено ни одной статьи.
				|Очищать нечего."
			);
			Возврат;
		КонецЕсли;
		// --- 
		
		ПОВ = Новый ОписаниеОповещения("ВыполнитьОчисткуБюджета",ЭтотОбъект); 
		ВыбратьПоЗаказуИлиПоГрузоперевозке(ПОВ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОчисткуБюджета(СтруктураРежима, ДополнительныеПараметры) Экспорт 
	// --- 
	
	ТекущиеДанные = Элементы.СписокВерсийБюджета.ТекущиеДанные;
	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиБюджета",ЭтотОбъект,Новый Структура("ТекущиеДанные,СтруктураРежима",ТекущиеДанные,СтруктураРежима)); 
	ПоказатьВопрос(ПОВ,
	"Версия бюджета ("""+ТекущиеДанные.Ссылка+""") будет очищена
	|"+СтруктураРежима.Режим+" """+СтруктураРежима.Объект+"""
	|Отмена действия будет невозможна.
	|Продолжить?"
	, РежимДиалогаВопрос.ОКОтмена); 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОчисткиБюджета(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.ОК) Тогда
		
		_БюджетОчистить(ДополнительныеПараметры.СтруктураРежима.Объект, ДополнительныеПараметры.ТекущиеДанные.Ссылка);
		
		Если НЕ (ЗначениеЗаполнено(Заказ) И (ДополнительныеПараметры.СтруктураРежима.Объект = Грузоперевозка)) Тогда 
			ДополнительныеПараметры.ТекущиеДанные.КоличествоСтатей = 0;
		КонецЕсли;
		флИзменилсяСоставИспользуемыхВерсий = Истина;
		
		Элементы.СписокВерсийБюджета.Обновить();
	
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ВыбратьПоЗаказуИлиПоГрузоперевозке(ПроцедураОбратногоВызова)
		
	выбРежим = Неопределено;
	выбОбъект = Неопределено;
	
	Если ЗначениеЗаполнено(Заказ) И ЗначениеЗаполнено(Грузоперевозка) Тогда 
		
		// вызвано из Грузоперевозки, привязанной к Заказу
		сз = Новый СписокЗначений;
		сз.Добавить("по заказу",         "По всему заказу ("+Заказ+")");
		сз.Добавить("по грузоперевозке", "По грузопереевозке ("+Грузоперевозка+")");
		// --- 
		ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораРежимаКопирования",ЭтотОбъект, Новый Структура("ПОВ",ПроцедураОбратногоВызова)); 
		// --- 
		ПоказатьВыборИзМеню(ПОВ,сз);
		
	ИначеЕсли ЗначениеЗаполнено(Грузоперевозка) Тогда 
		// Заказа нет, Грузоперевозка указана -- вызвано из Грузоперевозки, не привязанной к Заказу
		выбРежим = "по грузоперевозке";
		ЗаполнитьСтруктуруРежима(ПроцедураОбратногоВызова, выбРежим);
		
	ИначеЕсли ЗначениеЗаполнено(Заказ) Тогда 
		// Заказ есть, Грузоперевозки нет -- вызвано из Заказа
		выбРежим = "по заказу";
		ЗаполнитьСтруктуруРежима(ПроцедураОбратногоВызова, выбРежим);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРежимаКопирования(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		выбРежим = Ответ.Значение;
		ЗаполнитьСтруктуруРежима(ДополнительныеПараметры.ПОВ, выбРежим);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ЗаполнитьСтруктуруРежима(ПроцедураОбратногоВызова, Режим)
	// --- 
	
	Если Режим = "по заказу" Тогда 
		выбОбъект = Заказ;
	ИначеЕсли Режим = "по грузоперевозке" Тогда 
		выбОбъект = Грузоперевозка;
	КонецЕсли;

	СтруктураРежима = Новый Структура("Объект,Режим", выбОбъект, Режим);
	ВыполнитьОбработкуОповещения(ПроцедураОбратногоВызова,СтруктураРежима);
	
	// --- 
КонецПроцедуры
  

&НаСервере
Процедура _БюджетОчистить(выбОбъект, ВерсияБюджета)
	
	НачатьТранзакцию();
	
	УстановитьПривилегированныйРежим(Истина);
	масс = CW_Бюджетирование._ПолучитьМассивСтатейБюджета(выбОбъект, ВерсияБюджета);
	Для Каждого СтатьяСсылка Из масс Цикл 
		об = СтатьяСсылка.ПолучитьОбъект();
		об.Удалить();
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетКопировать(Команда)
	
	ТекущиеДанные = Элементы.СписокВерсийБюджета.ТекущиеДанные;
	Если (ТекущиеДанные <> Неопределено) Тогда 
		
		Если ТекущиеДанные.КоличествоСтатей=0 Тогда 
			ПоказатьПредупреждение(, "По текущей версия бюджета ("+ТекущиеДанные.Ссылка+") не введено ни одной статьи.
				|Копировать нечего.");
			Возврат;
		КонецЕсли;
				// --- 
		
		ПОВ = Новый ОписаниеОповещения("ВыполнитьКопированиеБюджета",ЭтотОбъект); 
		ВыбратьПоЗаказуИлиПоГрузоперевозке(ПОВ);
		
	Иначе
	
	ПоказатьПредупреждение(, "Для копирования версии бюджета необходимо 
			|выбрать элемент для копирования");
			Возврат;

	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКопированиеБюджета(СтруктураРежима, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (СтруктураРежима = Неопределено) Тогда 
		Возврат;
	КонецЕсли;
	выбОбъект = СтруктураРежима.Объект;
	выбРежим = СтруктураРежима.Режим;
	
	ТекущиеДанные = Элементы.СписокВерсийБюджета.ТекущиеДанные;
	ПОВ = Новый ОписаниеОповещения("ОбработкаРезультатаКопированияБюджета",ЭтотОбъект, Новый Структура("ТекущиеДанные,СтруктураРежима",ТекущиеДанные,СтруктураРежима)); 
	ПараметрыФормы = Новый Структура("БюджетИсходнаяВерсия, ОбъектСсылка", ТекущиеДанные.Ссылка, выбОбъект);
	ОткрытьФорму("Справочник.CW_ВерсииБюджетов.Форма.ФормаКопированияБюджета", ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ОбработкаРезультатаКопированияБюджета(новаяВерсияБюджета, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (новаяВерсияБюджета <> Неопределено) Тогда 
		
		_БюджетКопировать(ДополнительныеПараметры.СтруктураРежима.Объект, ДополнительныеПараметры.ТекущиеДанные.Ссылка, новаяВерсияБюджета);
		флИзменилсяСоставИспользуемыхВерсий = Истина;
		ПоказатьПредупреждение(,"Копирование версии бюджета выполнено.");
		// --- 
		Элементы.СписокВерсийБюджета.Обновить();
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _БюджетКопировать(выбОбъект, ВерсияБюджета, новаяВерсияБюджета)
	
	Если ЗначениеЗаполнено(ВерсияБюджета)
		И ЗначениеЗаполнено(новаяВерсияБюджета) 
		И (ВерсияБюджета<>новаяВерсияБюджета)
	Тогда 
	
		НачатьТранзакцию();
		УстановитьПривилегированныйРежим(Истина);
		
		// если по новой версии что-то есть
		масс = CW_Бюджетирование._ПолучитьМассивСтатейБюджета(выбОбъект, новаяВерсияБюджета);
		Для Каждого СтатьяСсылка Из масс Цикл 
			об = СтатьяСсылка.ПолучитьОбъект();
			об.Удалить();
		КонецЦикла;
		
		// копирование
		масс = CW_Бюджетирование._ПолучитьМассивСтатейБюджета(выбОбъект, ВерсияБюджета);
		Для Каждого СтатьяСсылка Из масс Цикл 
			об = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(об, СтатьяСсылка, , "Родитель");
			об.ВерсияБюджета = новаяВерсияБюджета;
			об.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокВерсийБюджетаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокВерсийБюджета.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		УстановитьИмяИкартинкуКнопкиНаСервере(ТекущиеДанные.ЭтоУтвержденнаяВерсия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИмяИкартинкуКнопкиНаСервере(ЭтоУтвержденнаяВерсия)
	
	Если ЭтоУтвержденнаяВерсия Тогда
		Элементы.СправочникВерсииБюджетовБюджетУтвердить.Заголовок = "Разблокировать";
		Элементы.СправочникВерсииБюджетовБюджетУтвердить.Картинка = БиблиотекаКартинок.CW_ЗамокОткрытый;
	Иначе
		Элементы.СправочникВерсииБюджетовБюджетУтвердить.Заголовок = "Заблокировать";
		Элементы.СправочникВерсииБюджетовБюджетУтвердить.Картинка = БиблиотекаКартинок.CW_Замок;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокВерсийБюджетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокВерсийБюджета.ТекущиеДанные;
	
	Если флРежимВыбораДляКопирования Тогда 
		Если ТекущиеДанные.Ссылка = ВерсияЗапрещененаяКВыбору Тогда 
			ПоказатьПредупреждение(,"Это исходная версия. А надо выбрать версию, в которой будет создана копия");
			Возврат;
		КонецЕсли;
		Если ТекущиеДанные.ЭтоУтвержденнаяВерсия Тогда 
			ПоказатьПредупреждение(,"Это утвержденная версия, в ней запрещены изменения.");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Закрыть(ТекущиеДанные.Ссылка);
	
КонецПроцедуры
